<a href="https://colab.research.google.com/github/murlokito/Miscellanea/blob/python_dev/Copy_of_001_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### **Nenhum Panda foi magoado durante este workshop**

![alt text](https://media.giphy.com/media/wbFiPNhOEVKkU/giphy.gif)


Porque infelizmente não estamos a falar de Pandas mas sim da biblioteca python "Pandas".

[Website oficial](https://pandas.pydata.org/)

## Imports usuais
Os blocos de código têm como escopo o notebook inteiro e não o bloco em si.
Este bloco, a seguir, por exemplo, as importações vão estar disponiveis em todo o notebook

In [0]:
'''Biblioteca para fazer tratamento e análise de informação'''
import pandas as pd


'''Biblioteca focada em computação cientifica e tratamento de dados'''
import numpy as np

'''Biblioteca para visualizar os resultados em graficos'''
import matplotlib.pyplot as plt

_Nota_: Ver o site do MatplotLib para saber que graficos consegue criar e exemplos de como os criar.

[Exemplos MatplotLib](https://matplotlib.org/gallery/index.html)

## Estruturas de dados

Existem duas estruturas de dados fundamentais em Pandas:
- [Series](https://pandas.pydata.org/pandas-docs/stable/dsintro.html#series)
- [DataFrames](https://pandas.pydata.org/pandas-docs/stable/dsintro.html#dataframe) - *A que iremos usar mais*

In [0]:
'''Series'''
s = pd.Series([1,3,"teste",np.nan])

# '''Visualizar 's' '''
s

0        1
1        3
2    teste
3      NaN
dtype: object

In [0]:
'''DataFrames'''
df = pd.DataFrame(
    { 
'A' : 1.,
'B' : pd.Timestamp('20130102'),
'C' : s,
'E' : pd.Categorical(["barco","comboio","teste","comboio"]),
'F' : 'foo' })

'''Visualizar 'df' '''
df # <-- Lembrar desta variável pois ira persistir pelo notebook

     A          B      C        E    F
0  1.0 2013-01-02      1    barco  foo
1  1.0 2013-01-02      3  comboio  foo
2  1.0 2013-01-02  teste    teste  foo
3  1.0 2013-01-02    NaN  comboio  foo

### Métodos de Visualização de 'DataFrames'

Existem vários comandos associados a "DataFrames" tais como:

* .head()
* .tail()
* .columns
* .values
* .describe()
* .mean()
* .T

---

#### Exercício #1
- Experimentar estes comandos na variável 'df'
- Porque aparecem menos colunas com o comando "mean()"

In [0]:
'''Exercicio #1'''

df.columns

Index(['A', 'B', 'C', 'E', 'F'], dtype='object')

## Seleccionar 

Podemos escolher só uma coluna do Dataframe fazendo: dataframe[< nome_da_coluna >] ou dataframe. < nome_da_coluna > o que irá retornar uma estrutura de dados *Serie* 


Se quisermos cortar a DataFrame também podemos usar [] para o efeito, como exemplo: *df[0:3]*, irá mostrar todas as linhas entre a primeira(0) e a terceira (2)

In [0]:
df[0:-2]

     A          B  C        E    F
0  1.0 2013-01-02  1    barco  foo
1  1.0 2013-01-02  3  comboio  foo

### Exercício #2
- Mostrar só a coluna 'E' da variável 'df'
- Mostrar da 2ª à 3ª linha

In [0]:
'''Exercicio #2'''

df.E[2:]# <Escrever Respostas Aqui>

2      teste
3    comboio
Name: E, dtype: category
Categories (3, object): [barco, comboio, teste]

Existem várias formas de selecionar dados de um Dataframe.
Deixo aqui links para consulta:

- [Selection By Label](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)
- [Selection by Position](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)


ProTip: Guardar estes links, que vão ser imprescindiveis no futuro.

## Editar

Se quisermos adicionar uma coluna ao nosso DataFrame basta associa-lo a uma nova coluna ou editar uma já existente.

Exemplo:

In [0]:
'''Inicialização'''
A = pd.Series([1,1,2,3,5,8])
B = np.random.rand(6)

dataframe = pd.DataFrame({ 'Feature_A' : A,'Feature_B' : B})

dataframe

   Feature_A  Feature_B
0          1   0.401751
1          1   0.981745
2          2   0.101996
3          3   0.387282
4          5   0.827570
5          8   0.985225

In [0]:
C = pd.Series(["Carro","Mota","Mota","Carro","Carro","Mota"])
dataframe["Feature_C"] = C

dataframe

   Feature_A  Feature_B Feature_C
0          1   0.401751     Carro
1          1   0.981745      Mota
2          2   0.101996      Mota
3          3   0.387282     Carro
4          5   0.827570     Carro
5          8   0.985225      Mota

Existem várias formas de editar um DataFrame, deixo uma listagem de formas

* [Concat](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging)
* [Join](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)
* [Append](https://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)
* [Group By](https://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

### Categorias (Categorical)
Acho este um dos mais importantes, tranforma dados continuous em categorias, um exemplo usual é tranformar notas de uma disciplina 0 a 100 para "Insuficiente", "Satisfaz", "Muito Bom" e depois ver quem passou ou não.

##### Inicialização do problema

In [0]:
'''
Criação do DataFrame com 6 'alunos' com diferentes ids e o respectivo 'valor+ que
teve num certo teste
'''
df_notas = pd.DataFrame({
    "aluno":[1100,1200,1004,1102,1105,1109],
    "valor":[10,50,80,99,50,60]})

'''Extra: Ordena o Dataframe de ordem decrescente de notas'''
#df_notas = df_notas.sort_values(by="valor", ascending=False)

df_notas

   aluno  valor
0   1100     10
1   1200     50
2   1004     80
3   1102     99
4   1105     50
5   1109     60

##### Categorização

Pega nos valores da coluna "valor" e categoriza de acordo com os ranges
indicados de acordo, exemplo: entre [50 e 70[ será um Satifaz

In [0]:
series_n = pd.cut(
    df_notas[['valor']].stack(),
    [0, 49, 70, 89, 100], # 0 < 50 < 70 < 90 < 100 
    labels=['Insuficiente', 'Satisfaz', 'Bom', 'Muito Bom']
)

series_n

0  valor    Insuficiente
1  valor        Satisfaz
2  valor             Bom
3  valor       Muito Bom
4  valor        Satisfaz
5  valor        Satisfaz
dtype: category
Categories (4, object): [Insuficiente < Satisfaz < Bom < Muito Bom]

Vamos tornar a ```series_n``` num Dataframe agora.

In [0]:
df_notas['nota'] = series_n.unstack()

df_notas

   aluno  valor          nota
0   1100     10  Insuficiente
1   1200     50      Satisfaz
2   1004     80           Bom
3   1102     99     Muito Bom
4   1105     50      Satisfaz
5   1109     60      Satisfaz

### Exercicio #3 
* Adicionar uma nova coluna ao dataframe "notas" que indique se o aluno passou (true) ou não (false), sendo que o valor se passou tem de ser a cima de 50
* Ordenar a tabela da melhor nota para a pior;

In [0]:
'''
Exercicio #3
- Usar o Dataframe 'df_notas'
'''

df_notas['aproveitamento'] = [True if d > 50 else False for d in df_notas['valor']]
df_notas

   aluno  valor          nota  aproveitamento
0   1100     10  Insuficiente           False
1   1200     50      Satisfaz           False
2   1004     80           Bom            True
3   1102     99     Muito Bom            True
4   1105     50      Satisfaz           False
5   1109     60      Satisfaz            True

In [0]:
df_notas = df_notas.sort_values(by=['valor'], ascending=False)
df_notas

   aluno  valor          nota  aproveitamento
3   1102     99     Muito Bom            True
2   1004     80           Bom            True
5   1109     60      Satisfaz            True
1   1200     50      Satisfaz           False
4   1105     50      Satisfaz           False
0   1100     10  Insuficiente           False

Categoricals source: [Categoricals](https://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical)